package main

import (
	"bytes"
	"strings"
	"testing"

	"github.com/matryer/is"
)

func Test(t *testing.T) {
	is := is.New(t)

	in := `{
		"is_disp_status": "1",
		"V_NA1": "10",
		"NA1": "10",
		"V_NA2": "8",
		"NA2": "8",
		"V_NA3": "12",
		"NA3": "12",
		"V_NA4": "13",
		"NA4": "13",
		"V_NA5": "15",
		"NA5": "15",
		"V_NA6": "12",
		"NA6": "12",
		"V_NA7": "10",
		"NA7": "10",
		"V_NA8": "13",
		"NA8": "13",
		"NA9": "10",
		"NA10": "12",
		"NA11": "60",
		"NA12": "50",
		"NA13": "60",
		"NA14": "65",
		"NS1": "",
		"NS2": "",
		"NS3": "",
		"NS4": "",
		"NS5": "",
		"NS6": "",
		"NS7": "",
		"NS8": "",
		"NS9": "",
		"NS10": "",
		"NS11": "",
		"NS12": "",
		"NS13": "",
		"NS14": "",
		"NM1": "",
		"NM2": "",
		"NM3": "",
		"NM4": "",
		"NM5": "",
		"NM6": "",
		"NM7": "",
		"NM8": "",
		"NM9": "",
		"NM10": "",
		"NM11": "",
		"NM12": "",
		"NM13": "",
		"NM14": "",
		"NP1": "10",
		"NP2": "8",
		"NP3": "12",
		"NP4": "13",
		"NP5": "15",
		"NP6": "12",
		"NP7": "10",
		"NP8": "13",
		"NP9": "10",
		"NP10": "12",
		"NP11": "60",
		"NP12": "50",
		"NP13": "60",
		"NP14": "65",
		"is_disp_san": "1",
		"SAN_Left": "",
		"SAN_Max": "99",
		"SAN_Danger": "0",
		"is_disp_power": "1",
		"TS_Total": "260",
		"TS_Maximum": "260",
		"TS_Add": "",
		"TK_Total": "100",
		"TK_Maximum": "100",
		"TK_Add": "",
		"is_disp_battlearts": "1",
		"TBAU": [
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"TBAD": [
			"26",
			"25",
			"25",
			"50",
			"10",
			"25",
			"1",
			"20",
			"15",
			"30",
			"15",
			"25"
		],
		"TBAS": [
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"TBAK": [
			"",
			"",
			"",
			"30",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"TBAA": [
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"TBAO": [
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"TBAP": [
			"26",
			"25",
			"25",
			"80",
			"10",
			"25",
			"1",
			"20",
			"15",
			"30",
			"15",
			"25"
		],
		"TBAS_Total": "0",
		"TBAK_Total": "30",
		"is_disp_findarts": "1",
		"TFAU": [
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"TFAD": [
			"30",
			"1",
			"15",
			"10",
			"25",
			"10",
			"10",
			"1",
			"10",
			"40",
			"25",
			"25"
		],
		"TFAS": [
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"60"
		],
		"TFAK": [
			"30",
			"40",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"TFAA": [
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"TFAO": [
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"TFAP": [
			"60",
			"41",
			"15",
			"10",
			"25",
			"10",
			"10",
			"1",
			"10",
			"40",
			"25",
			"85"
		],
		"TFAS_Total": "60",
		"TFAK_Total": "70",
		"is_disp_actarts": "1",
		"TAAU": [
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"unten_bunya": "",
		"TAAD": [
			"20",
			"20",
			"1",
			"5",
			"25",
			"5",
			"1",
			"25",
			"10",
			"10",
			"1"
		],
		"TAAS": [
			"",
			"",
			"",
			"",
			"",
			"30",
			"",
			"",
			"",
			"",
			"30"
		],
		"TAAK": [
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"TAAA": [
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"TAAO": [
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"TAAP": [
			"20",
			"20",
			"1",
			"5",
			"25",
			"35",
			"1",
			"25",
			"10",
			"10",
			"31"
		],
		"seisaku_bunya": "衣服",
		"main_souju_norimono": "",
		"TAAS_Total": "60",
		"TAAK_Total": "0",
		"is_disp_commuarts": "1",
		"TCAU": [
			"",
			"",
			"",
			"",
			""
		],
		"TCAD": [
			"5",
			"15",
			"15",
			"5",
			"65"
		],
		"TCAS": [
			"",
			"",
			"60",
			"",
			""
		],
		"TCAK": [
			"",
			"",
			"",
			"",
			""
		],
		"TCAA": [
			"",
			"",
			"",
			"",
			""
		],
		"TCAO": [
			"",
			"",
			"",
			"",
			""
		],
		"TCAP": [
			"5",
			"15",
			"75",
			"5",
			"65"
		],
		"mylang_name": "",
		"TCAS_Total": "60",
		"TCAK_Total": "0",
		"is_disp_knowarts": "1",
		"TKAU": [
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"TKAD": [
			"5",
			"5",
			"1",
			"0",
			"5",
			"10",
			"1",
			"1",
			"5",
			"1",
			"1",
			"1",
			"1",
			"1",
			"10",
			"1",
			"5",
			"1",
			"20"
		],
		"TKAS": [
			"",
			"",
			"",
			"",
			"10",
			"10",
			"",
			"",
			"60",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"TKAK": [
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"TKAA": [
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"TKAO": [
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"TKAP": [
			"5",
			"5",
			"1",
			"0",
			"15",
			"20",
			"1",
			"1",
			"65",
			"1",
			"1",
			"1",
			"1",
			"1",
			"10",
			"1",
			"5",
			"1",
			"20"
		],
		"geijutu_bunya": "衣服",
		"TKAS_Total": "80",
		"TKAK_Total": "0",
		"is_disp_battle": "0",
		"dmg_bonus": "0",
		"arms_name": [
			"",
			""
		],
		"arms_hit": [
			"",
			""
		],
		"arms_damage": [
			"",
			""
		],
		"arms_range": [
			"",
			""
		],
		"arms_attack_count": [
			"",
			""
		],
		"arms_last_shot": [
			"",
			""
		],
		"arms_vitality": [
			"",
			""
		],
		"arms_sonota": [
			"",
			""
		],
		"is_disp_item": "0",
		"item_name": [
			"",
			"",
			"",
			""
		],
		"item_tanka": [
			"",
			"",
			"",
			""
		],
		"item_num": [
			"1",
			"1",
			"1",
			"1"
		],
		"item_price": [
			"0",
			"0",
			"0",
			"0"
		],
		"item_memo": [
			"",
			"",
			"",
			""
		],
		"price_item_sum": "0",
		"money": "",
		"debt": "",
		"is_disp_personal": "1",
		"pc_name": "すー",
		"pc_tags": "",
		"shuzoku": "アパレルショップスタッフ",
		"age": "25",
		"sex": "女性",
		"pc_height": "150",
		"pc_weight": "49",
		"pc_kigen": "",
		"color_hair": "明るい茶",
		"color_eye": "",
		"color_skin": "",
		"pc_making_memo": "女性。人生を適当にいきてきた。高校卒業後アパレル系に就職。ショップスタッフ",
		"pc_making_memo_rows": "6",
		"message": "",
		"game": "coc",
		"data_id": 2137202,
		"phrase": "bdd0709d9532378710ceffc69301efe5",
		"data_title": "2",
		"save_limitate": "account",
		"dodontof_send_to": "https://ddntf.museru.com/DodontoF/DodontoF.swf",
		"dodontof_url": "",
		"dodontof_room": "",
		"koma_name": "",
		"dodontof_image": "",
		"dodontof_sc_colors": "",
		"elysion": "",
		"nechro": "",
		"": ""
	}`

	out := `["プロフィール"]
"キャラクター名" = "すー"
"職業"           = "アパレルショップスタッフ"
"年齢"           = 25
"性別"           = "女性"
"髪の色"         = "明るい茶"
"身長"           = 150
"体重"           = 49

["技能"]
STR = 10
CON = 8
POW = 12
DEX = 13
APP = 15
SIZ = 12
INT = 10
EDU = 13

["能力値"]
"応急手当"      = 30
"鍵開け"        = 40
"芸術"          = 10
"経理"          = 10
"こぶし/パンチ" = 30
"心理学"        = 60
"制作"          = 30
"説得"          = 60
"変装"          = 30
"目星"          = 60
`

	buf := new(bytes.Buffer)
	is.NoErr(run(buf, strings.NewReader(in)))
	is.Equal(buf.String(), out)
}
